let a = 0; // 변수 선언 과 동시에 값 할당
console.log(a); // 0

a = 1; // 값의 재할당
console.log(a); // 1

let b; // 변수 선언
console.log(b); // undefined

b = 2; // 값 할당
console.log(b); // 2

// 4.2 변수 선언 및 할당

// 어플리케이션 실행을 하면?
/** 1.입력(마우스나키보드로 데이터 입력) -> 2.처리(작성한 코드대로 처리(주어진 로직대로 코드를 처리)) -> 3.출력(모니터(처리된 데이터 출력))
 * 출력은 모니터에 보여주는 것 뿐만 아니라(output), 데이터를 파일시스템 쿠키 저장(storage) 또는 네트워크 통신을 통해 백엔드나 서버로 데이터를 보내는 것도 출력으로 볼 수 있다. */

/** 처리를 하려면 사용자가 원하는 데이터를 보관하기위해 변수가 필요
 * 변수:값을 저장하는 공간 , 자료를 저장할 수 있는 이름이 주어진 기억장소 */

// Let a; - 변수 선언(Variable declaration)

// Let a; = 0; 변수 선언과 값의 할당(Variable declaration and assignment)

//  a = 1; 값의 재할당(value reassignment)

/** point!!!
 * 1. 변수라는 것은 무언가를 임의로 저장할 수 있는 저장 장소
 * 2. 변수라는 것은 이름을 붙일 수 있다.
 * 3. 변수라는 것은 계속 변화 할 수 있으니까 값을 재할당 할 수 있다. */

/** 우리가 코드 상에 변수를 선언하고 값을 할당하게 되면 메모리에 어딘가에 데이터가 저장되고 메모리는 각각의 셀 마다 메모리 주소가 있다.
 *  이 때 변수 이름은 메모리 주소를 가르키고 있다고 볼 수 있다. */

// 변수 이름(식별자)을 쓰는이유 ? 메모리주소가 너무 복잡해서.. 어떤 데이터를 담고 있는지 알기 힘들다..
